In [11]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_parquet('../data/processed/application_train.parquet')
df.head()

,SK_ID_CURR,TARGET,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,...,FLAG_DOCUMENT_18,FLAG_DOCUMENT_19,FLAG_DOCUMENT_20,FLAG_DOCUMENT_21,AMT_REQ_CREDIT_BUREAU_HOUR,AMT_REQ_CREDIT_BUREAU_DAY,AMT_REQ_CREDIT_BUREAU_WEEK,AMT_REQ_CREDIT_BUREAU_MON,AMT_REQ_CREDIT_BUREAU_QRT,AMT_REQ_CREDIT_BUREAU_YEAR
0,100002,1,Cash loans,M,N,Y,0,202500.0,406597.5,24700.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,1.0
1,100003,0,Cash loans,F,N,N,0,270000.0,1293502.5,35698.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
2,100004,0,Revolving loans,M,Y,Y,0,67500.0,135000.0,6750.0,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
3,100006,0,Cash loans,F,N,Y,0,135000.0,312682.5,29686.5,...,0,0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
4,100007,0,Cash loans,M,N,Y,0,121500.0,513000.0,21865.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0

In [5]:
df['CREDIT_INCOME_RATIO'] =  df['AMT_CREDIT'] / df['AMT_INCOME_TOTAL']

In [6]:
df['ANNUITY_INCOME_RATIO'] = df['AMT_ANNUITY'] / df['AMT_INCOME_TOTAL']

In [7]:
df[['CREDIT_INCOME_RATIO', 'ANNUITY_INCOME_RATIO']]

        CREDIT_INCOME_RATIO  ANNUITY_INCOME_RATIO
0                  2.007889              0.121978
1                  4.790750              0.132217
2                  2.000000              0.100000
3                  2.316167              0.219900
4                  4.222222              0.179963
...                     ...                   ...
307506             1.617143              0.174971
307507             3.743750              0.166687
307508             4.429176              0.195941
307509             2.164368              0.118158
307510             4.285714              0.311857

[307511 rows x 2 columns]

In [9]:
df['DAYS_EMPLOYED'].value_counts()

DAYS_EMPLOYED
 365243    55374
-200         156
-224         152
-230         151
-199         151
           ...
-11471         1
-12878         1
-10573         1
-12990         1
-14184         1
Name: count, Length: 12574, dtype: int64

In [12]:
df['DAYS_EMPLOYED'].apply(lambda x: np.nan if x == 365243 else x)

0         -637.0
1        -1188.0
2         -225.0
3        -3039.0
4        -3038.0
           ...
307506    -236.0
307507       NaN
307508   -7921.0
307509   -4786.0
307510   -1262.0
Name: DAYS_EMPLOYED, Length: 307511, dtype: float64

In [15]:
import json
df = pd.read_parquet('../data/processed/application_train.parquet')
sample_dict = df.sample(1).drop('TARGET', axis=1).to_dict(orient='records')[0]

print(json.dumps({"features": sample_dict}))

{"features": {"SK_ID_CURR": 173252, "NAME_CONTRACT_TYPE": "Cash loans", "CODE_GENDER": "M", "FLAG_OWN_CAR": "Y", "FLAG_OWN_REALTY": "Y", "CNT_CHILDREN": 1, "AMT_INCOME_TOTAL": 157500.0, "AMT_CREDIT": 382500.0, "AMT_ANNUITY": 16335.0, "AMT_GOODS_PRICE": 382500.0, "NAME_TYPE_SUITE": "Unaccompanied", "NAME_INCOME_TYPE": "Working", "NAME_EDUCATION_TYPE": "Secondary / secondary special", "NAME_FAMILY_STATUS": "Married", "NAME_HOUSING_TYPE": "House / apartment", "REGION_POPULATION_RELATIVE": 0.015221, "DAYS_BIRTH": -16105, "DAYS_EMPLOYED": -490, "DAYS_REGISTRATION": -502.0, "DAYS_ID_PUBLISH": -4515, "OWN_CAR_AGE": 12.0, "FLAG_MOBIL": 1, "FLAG_EMP_PHONE": 1, "FLAG_WORK_PHONE": 0, "FLAG_CONT_MOBILE": 1, "FLAG_PHONE": 1, "FLAG_EMAIL": 0, "OCCUPATION_TYPE": "Laborers", "CNT_FAM_MEMBERS": 3.0, "REGION_RATING_CLIENT": 2, "REGION_RATING_CLIENT_W_CITY": 2, "WEEKDAY_APPR_PROCESS_START": "MONDAY", "HOUR_APPR_PROCESS_START": 17, "REG_REGION_NOT_LIVE_REGION": 0, "REG_REGION_NOT_WORK_REGION": 0, "LIVE_REGION_NOT_WORK_REGION": 0, "REG_CITY_NOT_LIVE_CITY": 1, "REG_CITY_NOT_WORK_CITY": 1, "LIVE_CITY_NOT_WORK_CITY": 0, "ORGANIZATION_TYPE": "Business Entity Type 3", "EXT_SOURCE_1": 0.5214607997671945, "EXT_SOURCE_2": 0.3816101970203633, "EXT_SOURCE_3": 0.445396241560834, "APARTMENTS_AVG": NaN, "BASEMENTAREA_AVG": NaN, "YEARS_BEGINEXPLUATATION_AVG": NaN, "YEARS_BUILD_AVG": NaN, "COMMONAREA_AVG": NaN, "ELEVATORS_AVG": NaN, "ENTRANCES_AVG": NaN, "FLOORSMAX_AVG": NaN, "FLOORSMIN_AVG": NaN, "LANDAREA_AVG": NaN, "LIVINGAPARTMENTS_AVG": NaN, "LIVINGAREA_AVG": NaN, "NONLIVINGAPARTMENTS_AVG": NaN, "NONLIVINGAREA_AVG": NaN, "APARTMENTS_MODE": NaN, "BASEMENTAREA_MODE": NaN, "YEARS_BEGINEXPLUATATION_MODE": NaN, "YEARS_BUILD_MODE": NaN, "COMMONAREA_MODE": NaN, "ELEVATORS_MODE": NaN, "ENTRANCES_MODE": NaN, "FLOORSMAX_MODE": NaN, "FLOORSMIN_MODE": NaN, "LANDAREA_MODE": NaN, "LIVINGAPARTMENTS_MODE": NaN, "LIVINGAREA_MODE": NaN, "NONLIVINGAPARTMENTS_MODE": NaN, "NONLIVINGAREA_MODE": NaN, "APARTMENTS_MEDI": NaN, "BASEMENTAREA_MEDI": NaN, "YEARS_BEGINEXPLUATATION_MEDI": NaN, "YEARS_BUILD_MEDI": NaN, "COMMONAREA_MEDI": NaN, "ELEVATORS_MEDI": NaN, "ENTRANCES_MEDI": NaN, "FLOORSMAX_MEDI": NaN, "FLOORSMIN_MEDI": NaN, "LANDAREA_MEDI": NaN, "LIVINGAPARTMENTS_MEDI": NaN, "LIVINGAREA_MEDI": NaN, "NONLIVINGAPARTMENTS_MEDI": NaN, "NONLIVINGAREA_MEDI": NaN, "FONDKAPREMONT_MODE": null, "HOUSETYPE_MODE": null, "TOTALAREA_MODE": NaN, "WALLSMATERIAL_MODE": null, "EMERGENCYSTATE_MODE": null, "OBS_30_CNT_SOCIAL_CIRCLE": 0.0, "DEF_30_CNT_SOCIAL_CIRCLE": 0.0, "OBS_60_CNT_SOCIAL_CIRCLE": 0.0, "DEF_60_CNT_SOCIAL_CIRCLE": 0.0, "DAYS_LAST_PHONE_CHANGE": -2487.0, "FLAG_DOCUMENT_2": 0, "FLAG_DOCUMENT_3": 1, "FLAG_DOCUMENT_4": 0, "FLAG_DOCUMENT_5": 0, "FLAG_DOCUMENT_6": 0, "FLAG_DOCUMENT_7": 0, "FLAG_DOCUMENT_8": 0, "FLAG_DOCUMENT_9": 0, "FLAG_DOCUMENT_10": 0, "FLAG_DOCUMENT_11": 0, "FLAG_DOCUMENT_12": 0, "FLAG_DOCUMENT_13": 0, "FLAG_DOCUMENT_14": 0, "FLAG_DOCUMENT_15": 0, "FLAG_DOCUMENT_16": 0, "FLAG_DOCUMENT_17": 0, "FLAG_DOCUMENT_18": 0, "FLAG_DOCUMENT_19": 0, "FLAG_DOCUMENT_20": 0, "FLAG_DOCUMENT_21": 0, "AMT_REQ_CREDIT_BUREAU_HOUR": 0.0, "AMT_REQ_CREDIT_BUREAU_DAY": 0.0, "AMT_REQ_CREDIT_BUREAU_WEEK": 0.0, "AMT_REQ_CREDIT_BUREAU_MON": 6.0, "AMT_REQ_CREDIT_BUREAU_QRT": 0.0, "AMT_REQ_CREDIT_BUREAU_YEAR": 1.0}}